<a href="https://colab.research.google.com/github/UznetDev/Data-science-home-work/blob/main/26_Avg_2024_home_work.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL**

### Import librares

In [1]:
import pandas as pd

### Set-up for SQL

In [2]:
%load_ext sql
%sql sqlite://

##### Load dataset

In [3]:
monarchs = pd.read_csv('monarchs.csv')
presidents = pd.read_csv('presidents.csv')
prime_minister_terms = pd.read_csv('prime_minister_terms.csv')
prime_ministers = pd.read_csv('prime_ministers.csv')
states = pd.read_csv('states.csv')

##### Upload dataset to SQL

In [4]:
%sql DROP TABLE IF EXISTS monarchs;
%sql --persist monarchs

%sql DROP TABLE IF EXISTS presidents;
%sql --persist presidents

%sql DROP TABLE IF EXISTS prime_minister_terms;
%sql --persist prime_minister_terms

%sql DROP TABLE IF EXISTS prime_ministers;
%sql --persist prime_ministers

%sql DROP TABLE IF EXISTS states;
%sql --persist states

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted states'

### Home work

##### View all table

In [5]:
%%sql SELECT * FROM monarchs LIMIT 1;

 * sqlite://
Done.

[(0, 'Brunei', 'Asia', 'Hassanal Bolkiah')]

In [6]:
%%sql SELECT * FROM presidents LIMIT 1;

 * sqlite://
Done.

[(0, 'Egypt', 'Africa', 'Abdel Fattah el-Sisi')]

In [7]:
%%sql SELECT * FROM prime_minister_terms LIMIT 1;

 * sqlite://
Done.

[(0, 'Mostafa Madbouly', 2018)]

In [8]:
%%sql SELECT * FROM prime_ministers LIMIT 1;

 * sqlite://
Done.

[(0, 'Egypt', 'Africa', 'Mostafa Madbouly')]

In [9]:
%%sql SELECT * FROM states LIMIT 1;

 * sqlite://
Done.

[(0, 'Australia', 'Oceania', 1901)]

##### Result

**Basic CASE WHEN in SELECT**

Write a query to list all countries along with a column that indicates whether the country gained independence before or after 1950. Use CASE WHEN in the SELECT clause to label countries as 'Before 1950' or 'After 1950' based on their indep_year.

In [10]:
%%sql
SELECT country,
       CASE WHEN indep_year < 1950 THEN 'Before 1950'
            ELSE 'After 1950'
       END AS indep_year_label
FROM states;

 * sqlite://
Done.

[('Australia', 'Before 1950'),
 ('Brunei', 'After 1950'),
 ('Chile', 'Before 1950'),
 ('Egypt', 'Before 1950'),
 ('India', 'Before 1950'),
 ('Norway', 'Before 1950'),
 ('Oman', 'After 1950'),
 ('Pakistan', 'Before 1950'),
 ('Portugal', 'Before 1950'),
 ('Uruguay', 'Before 1950'),
 ('USA', 'Before 1950')]

**CASE WHEN in WHERE Clause**

Write a query to list all countries that either have a president or a prime minister whose name starts with 'A'. Use CASE WHEN in the WHERE clause to filter results based on the presence of a president or prime minister starting with 'A'.

In [21]:
%%sql
SELECT country
FROM states AS s
WHERE country IN (
    SELECT
      CASE
        WHEN p.president LIKE 'A%'
        OR pm.prime_minister LIKE 'A%' THEN p.country
      END AS country
    FROM presidents AS p
    LEFT JOIN prime_ministers AS pm
    ON p.country = pm.country
);

 * sqlite://
Done.

[('Egypt',), ('Pakistan',), ('Portugal',)]

**CASE WHEN with Aggregation**

Write a query to list each continent and the number of countries it contains. Additionally, categorize each continent as 'Small' if it has fewer than 10 countries, 'Medium' if it has between 10 and 20 countries, and 'Large' if it has more than 20 countries. Use CASE WHEN in the SELECT clause for categorization.

In [24]:
%%sql
SELECT continent,
       CASE WHEN COUNT(country) < 10 THEN 'Small'
            WHEN COUNT(country) BETWEEN 10 AND 20 THEN 'Medium'
            ELSE 'Large'
       END AS continent_size
FROM states
GROUP BY continent;

 * sqlite://
Done.

[('Africa', 'Small'),
 ('Asia', 'Small'),
 ('Europe', 'Small'),
 ('North America', 'Small'),
 ('Oceania', 'Small'),
 ('South America', 'Small')]

In [25]:
%%sql
SELECT continent,
       COUNT(country) AS country_count,
       CASE WHEN COUNT(country) < 10 THEN 'Small'
            WHEN COUNT(country) BETWEEN 10 AND 20 THEN 'Medium'
            ELSE 'Large'
       END AS continent_size
FROM states
GROUP BY continent;

 * sqlite://
Done.

[('Africa', 1, 'Small'),
 ('Asia', 4, 'Small'),
 ('Europe', 2, 'Small'),
 ('North America', 1, 'Small'),
 ('Oceania', 1, 'Small'),
 ('South America', 2, 'Small')]

**CASE WHEN with Arithmetic Conditions**

Write a query to list all countries where the indep_year is either before 1800 or after 1950. Use CASE WHEN in the WHERE clause to specify these conditions.

In [27]:
%%sql
SELECT country, indep_year
FROM states
WHERE (CASE
        WHEN indep_year < 1800 OR indep_year > 1950 THEN 1 END)

 * sqlite://
Done.

[('Brunei', 1984), ('Oman', 1951), ('Portugal', 1143), ('USA', 1776)]

**Conditional Display in SELECT with CASE WHEN**

Write a query to list all prime ministers along with a column that indicates if they started their term before or after the year 2000. Use CASE WHEN in the SELECT clause to label them as 'Before 2000' or 'After 2000' based on the pm_start year.

In [30]:
%%sql
SELECT
    prime_minister,
    CASE
        WHEN pm_start < 2000 THEN 'Before 2000'
        ELSE 'After 2000'
    END AS term_start
FROM prime_minister_terms;

 * sqlite://
Done.

[('Mostafa Madbouly', 'After 2000'),
 ('António Costa', 'After 2000'),
 ('Shehbaz Sharif', 'After 2000'),
 ('Boris Johnson', 'After 2000'),
 ('Narendra Modi', 'After 2000'),
 ('Scott Morrison', 'After 2000'),
 ('Jonas Gahr Støre', 'After 2000'),
 ('Hassanal Bolkiah', 'Before 2000'),
 ('Haitham bin Tarik', 'After 2000'),
 ('Jacinda Ardern', 'After 2000')]